app/controllers/admin_controller.rb

  def index
    @posts = Post.find(:all, :conditions => "parent_id IS NULL")
---
SELECT * FROM "posts" WHERE ("posts".parent_id = 81) ORDER BY created_at

  def deleteuser
    if session[:admin_user] == true
      user = User.find_by_id(params[:id])
      user.post.each do|p|
        p.destroy
      end
    user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "posts" WHERE ("posts".parent_id = 73) ORDER BY created_at
DELETE FROM "posts" WHERE "id" = 73
DELETE FROM "users" WHERE "id" = 1

def makeadmin
  if session[:admin_user] == true
    user = User.find_by_id(params[:id])
    user.admin = 1
    user.save
---
SELECT * FROM "users" WHERE ("users"."id" = '8') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-29 00:51:47', "admin" = 1 WHERE "id" = 10

def revokeadmin
  if session[:admin_user] == true
    user = User.find_by_id(params[:id])
    user.admin = 0
    user.save
---
SELECT * FROM "users" WHERE ("users"."id" = '8') LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-29 17:22:52', "admin" = 0 WHERE "id" = 8

def user_activity
  # @post = Post.find(params[:search])

  search_what = params[:user_activity]
  search_condition = "%" + search_what + "%"

  @ccount = 0
  user = User.find_by_user_name(params[:user_activity])
  if user.nil?
    flash[:notice] = "User not found"
  else
    @pcount = user.post.count
    postss = user.post.find(:all)
    postss.each do |p|
      if p != nil

        @ccount = @ccount + Cheer.find_all_by_post_id(p.id).size
---
SELECT * FROM "users" WHERE ("users"."user_name" = 'newuser') LIMIT 1
SELECT count(*) AS count_all FROM "posts" WHERE ("posts".user_id = 8)
SELECT * FROM "posts" WHERE ("posts"."user_id" = 12) LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = 12)
SELECT * FROM "cheers" WHERE ("cheers"."post_id" = 92) LIMIT 1
SELECT count(*) AS count_all FROM "cheers" WHERE ("cheers".post_id = 92)