app/controllers/cheers_controller.rb

  def new
    #@cheer = Cheer.new(params[:id])
    post_id = params[:id]
    if session[:user_id] != nil
    post = Post.find_by_id(post_id)
    if post.user_id != session[:user_id] #do not allow cheering of own posts
    @cheer = Cheer.find_by_post_id_and_user_id(post_id, session[:user_id])
    #if post found, it is already cheered, dont cheer again. Else, new cheer
    if @cheer == nil
      @cheer = Cheer.new
      @cheer.post_id = post_id
      @cheer.user_id = session[:user_id]
      @cheer.rating = 1
      @cheer.save
---
SELECT * FROM "posts" WHERE ("posts"."id" IS NULL) LIMIT 1
SELECT * FROM "cheers" WHERE ("cheers"."post_id" = '96' AND "cheers"."user_id" IS NULL) LIMIT 1
INSERT INTO "cheers" ("rating", "created_at", "updated_at", "post_id", "user_id") VALUES(1, '2010-09-27 18:52:03', '2010-09-27 18:52:03', NULL, 6)