app/controllers/posts_controller.rb

  def index

    @posts = Post.find(:all,:conditions => "parent_id IS NULL" )
---
SELECT * FROM "posts" WHERE (parent_id IS NULL) ORDER BY created_at DESC

  def create
    #if session[:user_id] != nil
    @post = Post.new(params[:post])
    @post.user_id = session[:user_id]
    #@post.parent_id = session[:parent_id]
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "updated_at", "user_id", "parent_id", "description") VALUES('2010-09-27 22:51:45', '2010-09-27 22:51:45', 6, NULL, 'jhghjgjh')

  def update
    @post = Post.find(params[:id])
    if (is_post_by_user(session[:user_id], @post)||is_admin_user?)
      respond_to do |format|
        if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 74)
UPDATE "posts" SET "updated_at" = '2010-09-29 17:15:21', "description" = 'post to LIKE' WHERE "id" = 77

  def destroy
    @post = Post.find(params[:id])
    if @post != nil

      if (is_post_by_user(session[:user_id], @post) || is_admin_user?)
        respond_to do |format|
          if @post.destroy
---
SELECT * FROM "posts" WHERE ("posts".parent_id = 17) ORDER BY created_at
DELETE FROM "posts" WHERE "id" = 2

  def search
    # @post = Post.find(params[:search])

    search_what = params[:srch_criteria]
    search_condition = "%" + params[:search] + "%"
    if search_what == "1" #text

      @posts = Post.find(:all, :conditions => ['description LIKE ?',search_condition])
    elsif search_what == "2" #by username
      users = User.find(:all, :conditions => ['user_name LIKE ?', search_condition])
      @posts = Array.new
      for user1 in users do
        @posts = @posts | Post.find_all_by_user_id(user1.id)
---
SELECT * FROM "posts" WHERE ("posts".parent_id = 92) ORDER BY created_at
SELECT * FROM "users" WHERE ("users"."user_name" = '%new%') LIMIT 1
SELECT * FROM "posts" WHERE ("posts"."user_id" = 8) LIMIT 1