app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "admin", "user_name", "password") VALUES('2010-09-27 10:30:02', '2010-09-27 10:30:02', NULL, 'newuser1', '6ff0e95848ce2281e5dee74dee28b84b101fec85')